// localized port names

"ether"                   = "Ethernet";
"multiether"              = "Ethernet %@";
"pci-ether"               = "สล็อต PCI Ethernet %@";
"pci-multiether"          = "สล็อต PCI Ethernet %@, พอร์ต %@";
"usb-ether"               = "USB Ethernet (%@)";
"generic-ether"           = "อะแด็ปเตอร์ Ethernet (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "ตัวต่อเครือข่ายไร้สาย (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "สล็อต PCI FireWire %@";
"pci-multifirewire"       = "สล็อต PCI FireWire %@, พอร์ต %@";
"generic-firewire"        = "อะแด็ปเตอร์ Ethernet (%@)";

"bluetooth"               = "บลูทูธ DUN";
"bluetooth-modem"         = "อะแด็ปเตอร์สำหรับโมเด็มที่มี USB แบบบลูทูธ";
"bluetooth-modem-port"    = "พอร์ตของโมเด็มแบบบลูทูธ";
"generic-bluetooth-modem" = "โมเด็มแบบบลูทูธ (%@)";

"bluetooth-pan"           = "บลูทูธ PAN";

"irda"                    = "IrDA";
"irda-ircomm"             = "อะแด็ปเตอร์สำหรับโมเด็มที่มี USB แบบ IrDA";
"irda-ircomm-port"        = "พอร์ตโมเด็ม IrDA";

"loopback"                = "แบบวนกลับ";

"modem"                   = "โมเด็มภายใน";

"modem-port"              = "พอร์ตโมเด็ม";
"modem-printer-port"      = "พอร์ตของโมเด็ม/เครื่องพิมพ์";

"printer-port"            = "พอร์ตเครื่องพิมพ์";
"serial-port"             = "พอร์ตอนุกรม";

"usbmodem"                = "โมเด็ม USB"; 
"generic-usbmodem"        = "โมเด็ม USB (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "Ethernet บอนด์ (%@)";

"bridge"                  = "บริดจ์ (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"External Modem"          = "โมเด็มภายนอก";

"USB Ethernet"            = "USB Ethernet";
"USB Gigabit Ethernet"    = "USB Ethernet แบบจิกะบิต";

"iPhone"                  = "iPhone USB";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "Ethernet ภายใน";
"X-multiether"            = "Ethernet ภายใน %@";
"X-firewire"              = "FireWire ภายใน";
"X-bluetooth"             = "บลูทูธ";
"X-iPhone"                = "iPhone";
